Revit 2027 API
ReferenceIntersector.SetFilter Method
 Sets the ElementFilter used in intersection testing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFilter(
	ElementFilter filter
)
Public Sub SetFilter (
	filter As ElementFilter
)
public:
void SetFilter(
	ElementFilter^ filter
)
member SetFilter :
        filter : ElementFilter -> unit
Parameters
filter ElementFilter
 The ElementFilter. Pass null to remove the existing filter.
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace